{
  "sections": [
    {
      "title": "Humble beginnings",
      "content": "My first encounter with software development was at 13 years old. In 2016, I signed up for a youth robotics tournament, in which my team and I won first place (3 times in a row!). After my success, I acquired an interest in programming. I enrolled in a prestigious youth coding academy soon after, although I was by far the youngest person to ever attend that course. I learned what programming is, and how to make my first website. It was the starting point of my career.",
      "icon": "Home"
    },
    {
      "title": "Hard work pays off",
      "content": "Spending a few years learning is nothing to ignore, and as I found out, practicing programming at home in your free time really pays off. During this time, I had to decide which area to specialize in: frontend, backend, mobile... It was hard to decide, so I naturally tried everything. Nowadays I consider myself a full stack developer, capable of making web, desktop, and mobile applications, as well as backend servers, CLI tools, and games in multiple languages. It wasn't easy - I was going to high school at the same time and I was also competing in multiple tournaments organized by my school (in which our team, of course, won multiple times in a row again).",
      "icon": "Code"
    },
    {
      "title": "The snowball effect",
      "content": "In 2022, high school was ending, which meant I really had to get serious about my future. I was still very cautious when looking for jobs or education opportunities, because I was unsure what I was getting myself into. Thankfully, I didn't have to worry too much, because I got offered a summer internship! This was a great opportunity for me, and I learned a lot. In fact, I even got a job offer at the same company, which was quite a new experience to me. I was a freshman at this point, so unfortunately I had to decline the job offer in favor of focusing on my studies. Today, having experience behind my back, I'm looking for new opportunities to grow and learn.",
      "icon": "TrendingUp"
    }
  ],
  "showcaseTiles": [
    {
      "title": "Bitdraw",
      "description": "A simple HTML5 Canvas wrapper library for my personal projects",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/bitdraw",
        "imageUrl": "/assets/images/bitdraw_logo.png",
        "madeWith": ["Typescript", "Webpack"]
      }
    },
    {
      "title": "Diaspora",
      "description": "A match-making social media app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/diaspora-app",
        "imageUrl": "/assets/images/diaspora_logo.png",
        "madeWith": ["Flutter", "Firebase"]
      }
    },
    {
      "title": "Riskfactor",
      "description": "A COVID-19 risk assesment app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/riskfactor",
        "imageUrl": "/assets/images/riskfactor_logo.png",
        "madeWith": ["Flutter", "Firebase"]
      }
    },
    {
      "title": "Sportsmart",
      "description": "A modern fitness tracking app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/sportsmart-app",
        "imageUrl": "/assets/images/sportsmart_logo.png",
        "madeWith": ["React Native", "Algolia", "Firebase"]
      }
    },
    {
      "title": "MC Plugins",
      "description": "Various server-side addons for Spigot",
      "meta": {
        "imageUrl": "/assets/images/minecraft_logo.png",
        "madeWith": ["Java 17"]
      }
    },
    {
      "title": "JS Canvas apps",
      "description": "A variety of games and simulations made using the HTML5 Canvas API",
      "meta": {
        "imageUrl": "/assets/images/html5_canvas_logo.png",
        "madeWith": ["Typescript", "Webpack", "Bitdraw"]
      }
    },
    {
      "title": "Lucky Six",
      "description": "A realtime betting platform made during my internship",
      "meta": {
        "imageUrl": "/assets/images/lucky_six_logo.png",
        "madeWith": [
          "Spring Boot",
          "Postgres",
          "Socket.IO",
          "Vue 3",
          "Docker",
          "Redis"
        ]
      }
    }
  ],
  "techStack": [
    {
      "name": "Web",
      "description": "Stuff I use to make websites.",
      "items": [
        {
          "name": "Frontend",
          "description": "Clientside UI-building tools that I used, currently use, or otherwise enjoy.",
          "items": [
            {
              "name": "Javascript",
              "description": "What I started with, and what I still use and love.",
              "items": [
                {
                  "name": "Typescript",
                  "description": "This is the flavor of JS I use most of the time."
                },
                {
                  "name": "React",
                  "description": "My go-to library for building websites."
                },
                {
                  "name": "Svelte",
                  "description": "Great for effective solutions and working fast."
                },
                {
                  "name": "Angular",
                  "description": "A unique approach to building websites. I like it, but I don't use it often."
                }
              ]
            },
            {
              "name": "CSS",
              "description": "Having battled with CSS for years, I've found a few tools that I always keep under my belt.",
              "items": [
                {
                  "name": "Tailwind",
                  "description": "A library of utility-classes to use instead of writing your own. This is my favorite way to write CSS."
                },
                {
                  "name": "Material Design",
                  "description": "This technically has nothing to do with CSS, but it's my favorite design spec."
                }
              ]
            }
          ]
        },
        {
          "name": "Backend",
          "description": "Programming languages, frameworks, and services I use to develop APIs.",
          "items": [
            {
              "name": "NodeJS",
              "description": "What I'll use 80% of the time when making a robust backend.",
              "items": [
                {
                  "name": "NestJS",
                  "description": "My favorite way to write modular backends in NodeJS."
                },
                {
                  "name": "KoaJS",
                  "description": "Quite a bit better than ExpressJS. Very enjoyable and easy to use."
                }
              ]
            },
            {
              "name": "Java",
              "description": "A robust language with a lot of features. I use it for a lot of things.",
              "items": [
                {
                  "name": "Spring Boot",
                  "description": "Being the inspiration for NestJS, I like it a lot. Leaves no room for error and allows for a lot of customization."
                }
              ]
            },
            {
              "name": "SQL",
              "description": "Good ol' SQL. Although I rarely ever write it directly.",
              "items": [
                {
                  "name": "MariaDB",
                  "description": "My default database of choice."
                },
                {
                  "name": "Postgres",
                  "description": "Like MySQL but with extra features that make sense to implement."
                },
                {
                  "name": "MongoDB",
                  "description": "I love JSON = I love Mongo. Not really surprising. But I'd still use a RDBMS over it any day."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Mobile",
      "description": "What I use to make mobile applications (most of the time).",
      "items": [
        {
          "name": "React Native",
          "description": "I love React and the ecosystem around it. Combined with Expo, React Native is a joy to use."
        },
        {
          "name": "Flutter",
          "description": "I really like making desktop and mobile apps with it, but sometimes it feels a bit too verbose. Still one of my favorites."
        },
        {
          "name": "Firebase",
          "description": "My favorite BaaS. Comes in handy when I need a backend for my app, or an identity provider for my own custom backend."
        }
      ]
    },
    {
      "name": "Game Development",
      "description": "Mostly for fun, although it would be cool to make a full game someday...",
      "items": [
        {
          "name": "Godot",
          "description": "The most fun I've had developing software in ages. It's very easy to use and it's one of my favorite tools."
        },
        {
          "name": "Unity",
          "description": "My introduction to gamedev. It's actually pretty fun, but the age shows at times."
        }
      ]
    },
    {
      "name": "Miscellaneous",
      "description": "Random languages I occasionally use.",
      "items": [
        {
          "name": "Rust",
          "description": "I really like Rust, but I don't think I'm anyhwere near capable of using it."
        },
        {
          "name": "Python",
          "description": "I use it for CLI tools, services, automation, and web scraping. Pretty handy."
        },
        {
          "name": "Java",
          "description": "I use it to make Minecraft addons and mods, backends, or CLI tools and web scrapers."
        }
      ]
    }
  ]
}
