{
  "quotes": [
    {
      "quote": "The only way to do great work is to love what you do",
      "author": "Steve Jobs"
    },
    {
      "quote": "The best way to predict the future is to create it",
      "author": "Alan Kay"
    },
    {
      "quote": "The only limit to our realization of tomorrow will be our doubts of today",
      "author": "Franklin D. Roosevelt"
    },
    {
      "quote": "I cannot remember the books I've read any more than the meals I have eaten; even so, they have made me",
      "author": "Ralph Waldo Emerson"
    },
    {
      "quote": "To unlearn grass and sky in favor of where and why",
      "author": "exurb1a"
    },
    {
      "quote": "Don't believe everything you think",
      "author": "Buddha"
    },
    {
      "quote": "For small creatures such as we, the vastness of life is bearable only through love",
      "author": "Carl Sagan"
    },
    {
      "quote": "Ignorance is in our bones, but kindness is in our DNA",
      "author": "exurb1a"
    },
    {
      "quote": "There are no mistakes",
      "author": "Richard Bach"
    },
    {
      "quote": "The only way to make sense out of change is to plunge into it, move with it, and join the dance",
      "author": "Alan Watts"
    },
    {
      "quote": "It's possible to not make a single mistake yet still lose. That's not weakness, that's life",
      "author": "Jean Luc Picard"
    },
    {
      "quote": "If you wish to make an apple pie from scratch, you must first invent the universe",
      "author": "Carl Sagan"
    },
    {
      "quote": "Despite everything, it's still you",
      "author": "Flowey"
    }
  ],
  "sections": [
    {
      "title": "Humble beginnings",
      "content": "My first encounter with software development was at 13 years old.<br /><br />In 2016, I signed up for an annual youth robotics tournament organized by SPARK, in which my team and I won first place (3 years in a row!).<br /><br />After my success, I acquired an interest in programming. I enrolled in a prestigious coding academy soon after, which I successfully graduated although I was by far the youngest person to ever attend that course. I learned what programming is, and how to make my first website. It was the starting point of my career.",
      "icon": "Home"
    },
    {
      "title": "Hard work pays off",
      "content": "Spending a few years learning is nothing to ignore, and as I found out, practicing programming at home in your free time really pays off. During this time, I had to decide which area to specialize in: frontend, backend, mobile... It was hard to decide, so I naturally tried everything.<br /><br />Nowadays I consider myself a full stack developer, capable of making web, desktop, and mobile applications, as well as backend servers, CLI tools, and games in multiple languages. It wasn't easy however - I was going to high school at the same time and I was also competing in multiple tournaments organized by my school.<br /><br />(...in which my team, of course, won multiple times in a row again).",
      "icon": "Code"
    },
    {
      "title": "The snowball effect",
      "content": "In 2022, high school was ending, which meant I really had to get serious about my future. I was still very cautious when looking for jobs or education opportunities, because I was unsure what I was getting myself into.<br /><br />Thankfully, I didn't have to worry too much, because I got offered a summer internship! This was a great opportunity for me, and I learned a lot. In fact, I even got a job offer at the same company, which was quite a new experience to me.<br /><br />I was a freshman in university at this point, so unfortunately I had to decline the job offer in favor of focusing on my studies.<br /><br />Today, having experience behind my back, I'm looking for new opportunities to grow and learn.",
      "icon": "TrendingUp"
    }
  ],
  "showcaseTiles": [
    {
      "title": "Lucky Six",
      "description": "A realtime betting platform made during my internship",
      "meta": {
        "imageUrl": "/assets/images/lucky_six_logo.png",
        "madeWith": [
          "Java",
          "Spring Boot",
          "Postgres",
          "Socket.IO",
          "Vue 3",
          "Docker",
          "Redis"
        ]
      }
    },
    {
      "title": "FSRE Notifier",
      "description": "A personal experimental project to track my university timetable",
      "meta": {
        "linkUrl": "https://github.com/FSRE-Timetable-Notify/fsre-timetable-notify",
        "imageUrl": "/assets/images/fsre_timetable_notify.png",
        "madeWith": [
          "Java",
          "Spring Boot",
          "MariaDB",
          "Firebase",
          "React",
          "Tailwind",
          "Typescript",
          "Flutter",
          "Docker"
        ]
      }
    },
    {
      "title": "Sportsmart",
      "description": "A modern fitness tracking app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/sportsmart-app",
        "imageUrl": "/assets/images/sportsmart_logo.png",
        "madeWith": ["React Native", "Algolia", "Firebase"]
      }
    },
    {
      "title": "Riskfactor",
      "description": "A COVID-19 risk assesment app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/riskfactor",
        "imageUrl": "/assets/images/riskfactor_logo.png",
        "madeWith": ["Flutter", "Firebase"]
      }
    },
    {
      "title": "Diaspora",
      "description": "A match-making social media app",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/diaspora-app",
        "imageUrl": "/assets/images/diaspora_logo.png",
        "madeWith": ["Flutter", "Firebase"]
      }
    },
    {
      "title": "MC Plugins",
      "description": "Various private Spigot plugins for my MC servers",
      "meta": {
        "imageUrl": "/assets/images/minecraft_logo.png",
        "madeWith": ["Java"]
      }
    },
    {
      "title": "Bitdraw",
      "description": "A simple HTML5 Canvas wrapper library for my personal projects",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/bitdraw",
        "imageUrl": "/assets/images/bitdraw_logo.png",
        "madeWith": ["Typescript", "Webpack"]
      }
    },
    {
      "title": "RAMU Math App",
      "description": "An Expo project for a mobile app development class",
      "meta": {
        "linkUrl": "https://github.com/mapokapo/ramu-math-app",
        "imageUrl": "/assets/images/ramu_math_app.png",
        "madeWith": ["React Native", "Expo", "Typescript", "Firebase"]
      }
    }
  ],
  "techStack": [
    {
      "name": "Web",
      "description": "Stuff I use to make websites.",
      "items": [
        {
          "name": "Frontend",
          "description": "Clientside UI-building tools that I used, currently use, or otherwise enjoy.",
          "items": [
            {
              "name": "Javascript",
              "description": "What I started with, and what I still use and love.",
              "items": [
                {
                  "name": "Typescript",
                  "description": "This is the flavor of JS I use most of the time."
                },
                {
                  "name": "React",
                  "description": "My go-to library for building websites."
                },
                {
                  "name": "Svelte",
                  "description": "Great for effective solutions and working fast."
                },
                {
                  "name": "Angular",
                  "description": "A unique approach to building websites. I like it, but I don't use it often."
                }
              ]
            },
            {
              "name": "CSS",
              "description": "Having battled with CSS for years, I've found a few tools that I always keep under my belt.",
              "items": [
                {
                  "name": "Tailwind",
                  "description": "A library of utility-classes to use instead of writing your own. This is my favorite way to write CSS."
                },
                {
                  "name": "shadcn/ui",
                  "description": "The best React component library I've ever used. It has become a standard part of my frontend stack."
                },
                {
                  "name": "Material Design",
                  "description": "This technically has nothing to do with CSS, but it's my favorite design spec."
                }
              ]
            }
          ]
        },
        {
          "name": "Backend",
          "description": "Programming languages, frameworks, and services I use to develop APIs.",
          "items": [
            {
              "name": "Java",
              "description": "A robust language with a lot of features. I use it for most backend projects I make nowadays.",
              "items": [
                {
                  "name": "Spring Boot",
                  "description": "Having used it extensively in an internship, I like the way it handles backends. Makes complex projects easy."
                }
              ]
            },
            {
              "name": "NodeJS",
              "description": "Though there are better alternatives, NodeJS was was my first exposure to backend and it still holds up.",
              "items": [
                {
                  "name": "NestJS",
                  "description": "My favorite way to write modular backends in NodeJS."
                },
                {
                  "name": "KoaJS",
                  "description": "Quite a bit better than ExpressJS. Very enjoyable and easy to use."
                },
                {
                  "name": "Bun",
                  "description": "A bit weird to label this as 'a subset of NodeJS', but Bun provides -a lot- OOTB, including a fast npm alternative."
                }
              ]
            },
            {
              "name": "SQL",
              "description": "Good ol' SQL.",
              "items": [
                {
                  "name": "MariaDB",
                  "description": "My default database of choice."
                },
                {
                  "name": "Postgres",
                  "description": "Like MySQL but with extra features that make sense to implement."
                },
                {
                  "name": "MongoDB",
                  "description": "JSON is pretty nice. Having said that, I'd still rather use an RDBMS."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Mobile",
      "description": "What I use to make mobile applications (most of the time).",
      "items": [
        {
          "name": "React Native",
          "description": "I love React and the ecosystem around it. Combined with Expo, it is very powerful and productive environment."
        },
        {
          "name": "Flutter",
          "description": "I really like making desktop and mobile apps with it, but sometimes it feels a bit too verbose. Still one of my favorites for its performance and DX."
        },
        {
          "name": "Firebase",
          "description": "My favorite BaaS. Comes in handy when I need a backend for my app, or an identity provider for my own custom backend."
        }
      ]
    },
    {
      "name": "Game Development",
      "description": "Mostly for fun, although it would be cool to make a full game someday...",
      "items": [
        {
          "name": "Godot",
          "description": "The most fun I've had developing software in ages. It's very easy to use and it's one of my favorite tools."
        },
        {
          "name": "Unity",
          "description": "My introduction to gamedev. It's actually pretty fun, but the age shows at times."
        }
      ]
    },
    {
      "name": "Miscellaneous",
      "description": "Random languages or tools I occasionally use.",
      "items": [
        {
          "name": "Rust",
          "description": "I really like Rust, but I don't think I'm anyhwere near capable of using it."
        },
        {
          "name": "Python",
          "description": "I use it for CLI tools, services, automation, and web scraping. Pretty handy."
        },
        {
          "name": "Java",
          "description": "I use it to make Minecraft addons and mods, backends, or CLI tools and web scrapers."
        },
        {
          "name": "C#",
          "description": "I had a light exposure to C# and I could imagine myself working with it in the future."
        },
        {
          "name": "Pocketbase",
          "description": "A lightweight Firebase alternative which (IMO) has a better API, and uses SQL instead of NoSQL. Sounds too good to be true."
        }
      ]
    }
  ]
}
